nxp-mcuxpresso/mcux-sdk-examples/evkmimxrt685/edgefast_bluetooth_examples/handsfree_ag/pin_mux.h
/*
 * Copyright 2021, 2024  NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

#define IOPCTL_PIO_ANAMUX_DI 0x00u        /*!<@brief Analog mux is disabled */
#define IOPCTL_PIO_FULLDRIVE_DI 0x00u     /*!<@brief Normal drive */
#define IOPCTL_PIO_FUNC1 0x01u            /*!<@brief Selects pin function 1 */
#define IOPCTL_PIO_INBUF_DI 0x00u         /*!<@brief Disable input buffer function */
#define IOPCTL_PIO_INBUF_EN 0x40u         /*!<@brief Enables input buffer function */
#define IOPCTL_PIO_INV_DI 0x00u           /*!<@brief Input function is not inverted */
#define IOPCTL_PIO_PSEDRAIN_DI 0x00u      /*!<@brief Pseudo Output Drain is disabled */
#define IOPCTL_PIO_PULLUP_EN 0x20u        /*!<@brief Enable pull-up function */
#define IOPCTL_PIO_PUPD_EN 0x10u          /*!<@brief Enable pull-up / pull-down function */
#define IOPCTL_PIO_SLEW_RATE_NORMAL 0x00u /*!<@brief Normal mode */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void); /* Function assigned for the Cortex-M33 */

#define IOPCTL_PIO_ANAMUX_DI 0x00u        /*!<@brief Analog mux is disabled */
#define IOPCTL_PIO_FULLDRIVE_DI 0x00u     /*!<@brief Normal drive */
#define IOPCTL_PIO_FUNC1 0x01u            /*!<@brief Selects pin function 1 */
#define IOPCTL_PIO_INBUF_DI 0x00u         /*!<@brief Disable input buffer function */
#define IOPCTL_PIO_INBUF_EN 0x40u         /*!<@brief Enables input buffer function */
#define IOPCTL_PIO_INV_DI 0x00u           /*!<@brief Input function is not inverted */
#define IOPCTL_PIO_PSEDRAIN_DI 0x00u      /*!<@brief Pseudo Output Drain is disabled */
#define IOPCTL_PIO_PULLDOWN_EN 0x00u      /*!<@brief Enable pull-down function */
#define IOPCTL_PIO_PULLUP_EN 0x20u        /*!<@brief Enable pull-up function */
#define IOPCTL_PIO_PUPD_DI 0x00u          /*!<@brief Disable pull-up / pull-down function */
#define IOPCTL_PIO_PUPD_EN 0x10u          /*!<@brief Enable pull-up / pull-down function */
#define IOPCTL_PIO_SLEW_RATE_NORMAL 0x00u /*!<@brief Normal mode */

/*! @name SWO (coord L16), U7[12]
  @{ */
/* Routed pin properties */
#define BOARD_INITDEBUG_UARTPINS_SWO_PERIPHERAL SWD /*!<@brief Peripheral name */
#define BOARD_INITDEBUG_UARTPINS_SWO_SIGNAL SWO     /*!<@brief Signal name */
                                                    /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitDEBUG_UARTPins(void); /* Function assigned for the Cortex-M33 */

#define IOPCTL_PIO_ANAMUX_DI 0x00u        /*!<@brief Analog mux is disabled */
#define IOPCTL_PIO_FULLDRIVE_DI 0x00u     /*!<@brief Normal drive */
#define IOPCTL_PIO_FULLDRIVE_EN 0x0100u   /*!<@brief Full drive enable */
#define IOPCTL_PIO_FUNC5 0x05u            /*!<@brief Selects pin function 5 */
#define IOPCTL_PIO_FUNC6 0x06u            /*!<@brief Selects pin function 6 */
#define IOPCTL_PIO_INBUF_EN 0x40u         /*!<@brief Enables input buffer function */
#define IOPCTL_PIO_INV_DI 0x00u           /*!<@brief Input function is not inverted */
#define IOPCTL_PIO_PSEDRAIN_DI 0x00u      /*!<@brief Pseudo Output Drain is disabled */
#define IOPCTL_PIO_PULLDOWN_EN 0x00u      /*!<@brief Enable pull-down function */
#define IOPCTL_PIO_PUPD_DI 0x00u          /*!<@brief Disable pull-up / pull-down function */
#define IOPCTL_PIO_SLEW_RATE_NORMAL 0x00u /*!<@brief Normal mode */

/*! @name FLEXSPI0B_DATA0 (coord L2), U19[D3]
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_INITFLEXSPIFLASHPINS_QSPI_B_DATA0_PERIPHERAL FLEXSPI
/*!
 * @brief Signal name */
#define BOARD_INITFLEXSPIFLASHPINS_QSPI_B_DATA0_SIGNAL FLEXSPI_B_DATA0
/* @} */

/*! @name FLEXSPI0B_DATA1 (coord M2), U19[D2]
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_INITFLEXSPIFLASHPINS_QSPI_B_DATA1_PERIPHERAL FLEXSPI
/*!
 * @brief Signal name */
#define BOARD_INITFLEXSPIFLASHPINS_QSPI_B_DATA1_SIGNAL FLEXSPI_B_DATA1
/* @} */

/*! @name FLEXSPI0B_DATA2 (coord N1), U19[C4]
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_INITFLEXSPIFLASHPINS_QSPI_B_DATA2_PERIPHERAL FLEXSPI
/*!
 * @brief Signal name */
#define BOARD_INITFLEXSPIFLASHPINS_QSPI_B_DATA2_SIGNAL FLEXSPI_B_DATA2
/* @} */

/*! @name FLEXSPI0B_DATA3 (coord N2), U19[D4]
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_INITFLEXSPIFLASHPINS_QSPI_B_DATA3_PERIPHERAL FLEXSPI
/*!
 * @brief Signal name */
#define BOARD_INITFLEXSPIFLASHPINS_QSPI_B_DATA3_SIGNAL FLEXSPI_B_DATA3
/* @} */

/*! @name FLEXSPI0B_DATA4 (coord U1), U19[D5]
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_INITFLEXSPIFLASHPINS_QSPI_B_DATA4_PERIPHERAL FLEXSPI
/*!
 * @brief Signal name */
#define BOARD_INITFLEXSPIFLASHPINS_QSPI_B_DATA4_SIGNAL FLEXSPI_B_DATA4
/* @} */

/*! @name FLEXSPI0B_DATA5 (coord R2), U19[E3]
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_INITFLEXSPIFLASHPINS_QSPI_B_DATA5_PERIPHERAL FLEXSPI
/*!
 * @brief Signal name */
#define BOARD_INITFLEXSPIFLASHPINS_QSPI_B_DATA5_SIGNAL FLEXSPI_B_DATA5
/* @} */

/*! @name FLEXSPI0B_DATA6 (coord P3), U19[E2]
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_INITFLEXSPIFLASHPINS_QSPI_B_DATA6_PERIPHERAL FLEXSPI
/*!
 * @brief Signal name */
#define BOARD_INITFLEXSPIFLASHPINS_QSPI_B_DATA6_SIGNAL FLEXSPI_B_DATA6
/* @} */

/*! @name FLEXSPI0B_DATA7 (coord P5), U19[E1]
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_INITFLEXSPIFLASHPINS_QSPI_B_DATA7_PERIPHERAL FLEXSPI
/*!
 * @brief Signal name */
#define BOARD_INITFLEXSPIFLASHPINS_QSPI_B_DATA7_SIGNAL FLEXSPI_B_DATA7
/* @} */

/*! @name FLEXSPI0B_SS0_N (coord T2), U19[C2]
  @{ */
/* Routed pin properties */
#define BOARD_INITFLEXSPIFLASHPINS_QSPI_B_CS0_PERIPHERAL FLEXSPI       /*!<@brief Peripheral name */
#define BOARD_INITFLEXSPIFLASHPINS_QSPI_B_CS0_SIGNAL FLEXSPI_B_SS0_B   /*!<@brief Signal name */
                                                                       /* @} */

