nxp-mcuxpresso/mcux-sdk-examples/evkmimxrt685/edgefast_bluetooth_examples/handsfree_ag/pin_mux.h
#define IOPCTL_PIO_ANAMUX_DI 0x00u        /*!<@brief Analog mux is disabled */
#define IOPCTL_PIO_FULLDRIVE_EN 0x0100u   /*!<@brief Full drive enable */
#define IOPCTL_PIO_FUNC1 0x01u            /*!<@brief Selects pin function 1 */
#define IOPCTL_PIO_INBUF_DI 0x00u         /*!<@brief Disable input buffer function */
#define IOPCTL_PIO_INBUF_EN 0x40u         /*!<@brief Enables input buffer function */
#define IOPCTL_PIO_INV_DI 0x00u           /*!<@brief Input function is not inverted */
#define IOPCTL_PIO_PSEDRAIN_DI 0x00u      /*!<@brief Pseudo Output Drain is disabled */
#define IOPCTL_PIO_PULLDOWN_EN 0x00u      /*!<@brief Enable pull-down function */
#define IOPCTL_PIO_PUPD_DI 0x00u          /*!<@brief Disable pull-up / pull-down function */
#define IOPCTL_PIO_SLEW_RATE_NORMAL 0x00u /*!<@brief Normal mode */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_Init_Audio_Pins(void); /* Function assigned for the Cortex-M33 */

#define IOPCTL_PIO_ANAMUX_DI 0x00u        /*!<@brief Analog mux is disabled */
#define IOPCTL_PIO_FULLDRIVE_DI 0x00u     /*!<@brief Normal drive */
#define IOPCTL_PIO_FULLDRIVE_EN 0x0100u   /*!<@brief Full drive enable */
#define IOPCTL_PIO_FUNC0 0x00u            /*!<@brief Selects pin function 0 */
#define IOPCTL_PIO_FUNC5 0x05u            /*!<@brief Selects pin function 5 */
#define IOPCTL_PIO_FUNC6 0x06u            /*!<@brief Selects pin function 6 */
#define IOPCTL_PIO_INBUF_DI 0x00u         /*!<@brief Disable input buffer function */
#define IOPCTL_PIO_INBUF_EN 0x40u         /*!<@brief Enables input buffer function */
#define IOPCTL_PIO_INV_DI 0x00u           /*!<@brief Input function is not inverted */
#define IOPCTL_PIO_PSEDRAIN_DI 0x00u      /*!<@brief Pseudo Output Drain is disabled */
#define IOPCTL_PIO_PULLDOWN_EN 0x00u      /*!<@brief Enable pull-down function */
#define IOPCTL_PIO_PUPD_DI 0x00u          /*!<@brief Disable pull-up / pull-down function */
#define IOPCTL_PIO_SLEW_RATE_NORMAL 0x00u /*!<@brief Normal mode */

/*! @name FLEXSPI0B_DATA0 (coord L2), U19[D3]
  @{ */
/* Routed pin properties */
#define BOARD_INITFLEXSPI0BPINS_QSPI_B_DATA0_PERIPHERAL FLEXSPI       /*!<@brief Peripheral name */
#define BOARD_INITFLEXSPI0BPINS_QSPI_B_DATA0_SIGNAL FLEXSPI_B_DATA0   /*!<@brief Signal name */
                                                                      /* @} */

/*! @name FLEXSPI0B_DATA1 (coord M2), U19[D2]
  @{ */
/* Routed pin properties */
#define BOARD_INITFLEXSPI0BPINS_QSPI_B_DATA1_PERIPHERAL FLEXSPI       /*!<@brief Peripheral name */
#define BOARD_INITFLEXSPI0BPINS_QSPI_B_DATA1_SIGNAL FLEXSPI_B_DATA1   /*!<@brief Signal name */
                                                                      /* @} */

/*! @name FLEXSPI0B_DATA2 (coord N1), U19[C4]
  @{ */
/* Routed pin properties */
#define BOARD_INITFLEXSPI0BPINS_QSPI_B_DATA2_PERIPHERAL FLEXSPI       /*!<@brief Peripheral name */
#define BOARD_INITFLEXSPI0BPINS_QSPI_B_DATA2_SIGNAL FLEXSPI_B_DATA2   /*!<@brief Signal name */
                                                                      /* @} */

/*! @name FLEXSPI0B_DATA3 (coord N2), U19[D4]
  @{ */
/* Routed pin properties */
#define BOARD_INITFLEXSPI0BPINS_QSPI_B_DATA3_PERIPHERAL FLEXSPI       /*!<@brief Peripheral name */
#define BOARD_INITFLEXSPI0BPINS_QSPI_B_DATA3_SIGNAL FLEXSPI_B_DATA3   /*!<@brief Signal name */
                                                                      /* @} */

/*! @name FLEXSPI0B_DATA4 (coord U1), U19[D5]
  @{ */
/* Routed pin properties */
#define BOARD_INITFLEXSPI0BPINS_QSPI_B_DATA4_PERIPHERAL FLEXSPI       /*!<@brief Peripheral name */
#define BOARD_INITFLEXSPI0BPINS_QSPI_B_DATA4_SIGNAL FLEXSPI_B_DATA4   /*!<@brief Signal name */
                                                                      /* @} */

/*! @name FLEXSPI0B_DATA5 (coord R2), U19[E3]
  @{ */
/* Routed pin properties */
#define BOARD_INITFLEXSPI0BPINS_QSPI_B_DATA5_PERIPHERAL FLEXSPI       /*!<@brief Peripheral name */
#define BOARD_INITFLEXSPI0BPINS_QSPI_B_DATA5_SIGNAL FLEXSPI_B_DATA5   /*!<@brief Signal name */
                                                                      /* @} */

/*! @name FLEXSPI0B_DATA6 (coord P3), U19[E2]
  @{ */
/* Routed pin properties */
#define BOARD_INITFLEXSPI0BPINS_QSPI_B_DATA6_PERIPHERAL FLEXSPI       /*!<@brief Peripheral name */
#define BOARD_INITFLEXSPI0BPINS_QSPI_B_DATA6_SIGNAL FLEXSPI_B_DATA6   /*!<@brief Signal name */
                                                                      /* @} */

/*! @name FLEXSPI0B_DATA7 (coord P5), U19[E1]
  @{ */
/* Routed pin properties */
#define BOARD_INITFLEXSPI0BPINS_QSPI_B_DATA7_PERIPHERAL FLEXSPI       /*!<@brief Peripheral name */
#define BOARD_INITFLEXSPI0BPINS_QSPI_B_DATA7_SIGNAL FLEXSPI_B_DATA7   /*!<@brief Signal name */
                                                                      /* @} */

/*! @name FLEXSPI0B_SCLK (coord U3), U19[B2]
  @{ */
/* Routed pin properties */
#define BOARD_INITFLEXSPI0BPINS_QSPI_B_SCK_PERIPHERAL FLEXSPI      /*!<@brief Peripheral name */
#define BOARD_INITFLEXSPI0BPINS_QSPI_B_SCK_SIGNAL FLEXSPI_B_SCLK   /*!<@brief Signal name */
                                                                   /* @} */

/*! @name FLEXSPI0B_SS0_N (coord T2), U19[C2]
  @{ */
/* Routed pin properties */
#define BOARD_INITFLEXSPI0BPINS_QSPI_B_CS0_PERIPHERAL FLEXSPI       /*!<@brief Peripheral name */
#define BOARD_INITFLEXSPI0BPINS_QSPI_B_CS0_SIGNAL FLEXSPI_B_SS0_B   /*!<@brief Signal name */
                                                                    /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitFlexSPI0BPins(void); /* Function assigned for the Cortex-M33 */

#define IOPCTL_PIO_ANAMUX_DI 0x00u        /*!<@brief Analog mux is disabled */
#define IOPCTL_PIO_FULLDRIVE_EN 0x0100u   /*!<@brief Full drive enable */
#define IOPCTL_PIO_FUNC1 0x01u            /*!<@brief Selects pin function 1 */
#define IOPCTL_PIO_INBUF_EN 0x40u         /*!<@brief Enables input buffer function */
#define IOPCTL_PIO_INV_DI 0x00u           /*!<@brief Input function is not inverted */
#define IOPCTL_PIO_PSEDRAIN_DI 0x00u      /*!<@brief Pseudo Output Drain is disabled */
#define IOPCTL_PIO_PULLDOWN_EN 0x00u      /*!<@brief Enable pull-down function */
#define IOPCTL_PIO_PUPD_DI 0x00u          /*!<@brief Disable pull-up / pull-down function */
#define IOPCTL_PIO_SLEW_RATE_NORMAL 0x00u /*!<@brief Normal mode */

/*! @name FC5_RXD_SDA_MOSI_DATA (coord J16), J28[4]/JP30[1]/J45[22]
  @{ */
/* Routed pin properties */
#define BOARD_INITSCOPINS_ACC_INT_PERIPHERAL FLEXCOMM5           /*!<@brief Peripheral name */
#define BOARD_INITSCOPINS_ACC_INT_SIGNAL RXD_SDA_MOSI_DATA       /*!<@brief Signal name */
                                                                 /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitScoPins(void); /* Function assigned for the Cortex-M33 */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
